{"format":"layers-model","generatedBy":"keras v3.10.0","convertedBy":"TensorFlow.js Converter v4.22.0","modelTopology":{"keras_version":"3.10.0","backend":"tensorflow","model_config":{"class_name":"Sequential","config":{"name":"sequential_1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"layers":[{"class_name":"InputLayer","config":{"dtype":"float32","sparse":false,"ragged":false,"name":"input_layer_1","batchInputShape":[null,51]}},{"class_name":"Dense","config":{"name":"dense_5","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"HeNormal","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null}},{"class_name":"BatchNormalization","config":{"name":"batch_normalization_2","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"gamma_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"moving_mean_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"moving_variance_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"synchronized":false}},{"class_name":"Dropout","config":{"name":"dropout_3","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"rate":0.3,"seed":null,"noise_shape":null}},{"class_name":"Dense","config":{"name":"dense_6","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"HeNormal","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null}},{"class_name":"BatchNormalization","config":{"name":"batch_normalization_3","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"gamma_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"moving_mean_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"moving_variance_initializer":{"module":"keras.initializers","class_name":"Ones","config":{},"registered_name":null},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"synchronized":false}},{"class_name":"Dropout","config":{"name":"dropout_4","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"rate":0.25,"seed":null,"noise_shape":null}},{"class_name":"Dense","config":{"name":"dense_7","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"HeNormal","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null}},{"class_name":"Dropout","config":{"name":"dropout_5","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"rate":0.2,"seed":null,"noise_shape":null}},{"class_name":"Dense","config":{"name":"dense_8","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"HeNormal","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null}},{"class_name":"Dense","config":{"name":"dense_9","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":1,"activation":"softplus","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null}}],"build_input_shape":[null,51]}},"training_config":{"loss":"mse","loss_weights":null,"metrics":["mae"],"weighted_metrics":null,"run_eagerly":false,"steps_per_execution":1,"jit_compile":true,"optimizer_config":{"class_name":"Adam","config":{"name":"adam","learning_rate":0.0001250000059371814,"weight_decay":null,"clipnorm":null,"global_clipnorm":null,"clipvalue":null,"use_ema":false,"ema_momentum":0.99,"ema_overwrite_frequency":null,"loss_scale_factor":null,"gradient_accumulation_steps":null,"beta_1":0.9,"beta_2":0.999,"epsilon":1e-07,"amsgrad":false}}}},"weightsManifest":[{"paths":["group1-shard1of1.bin"],"weights":[{"name":"sequential_1/batch_normalization_2/gamma","shape":[128],"dtype":"float32"},{"name":"sequential_1/batch_normalization_2/beta","shape":[128],"dtype":"float32"},{"name":"sequential_1/batch_normalization_2/moving_mean","shape":[128],"dtype":"float32"},{"name":"sequential_1/batch_normalization_2/moving_variance","shape":[128],"dtype":"float32"},{"name":"sequential_1/batch_normalization_3/gamma","shape":[64],"dtype":"float32"},{"name":"sequential_1/batch_normalization_3/beta","shape":[64],"dtype":"float32"},{"name":"sequential_1/batch_normalization_3/moving_mean","shape":[64],"dtype":"float32"},{"name":"sequential_1/batch_normalization_3/moving_variance","shape":[64],"dtype":"float32"},{"name":"sequential_1/dense_5/kernel","shape":[51,128],"dtype":"float32"},{"name":"sequential_1/dense_5/bias","shape":[128],"dtype":"float32"},{"name":"sequential_1/dense_6/kernel","shape":[128,64],"dtype":"float32"},{"name":"sequential_1/dense_6/bias","shape":[64],"dtype":"float32"},{"name":"sequential_1/dense_7/kernel","shape":[64,32],"dtype":"float32"},{"name":"sequential_1/dense_7/bias","shape":[32],"dtype":"float32"},{"name":"sequential_1/dense_8/kernel","shape":[32,16],"dtype":"float32"},{"name":"sequential_1/dense_8/bias","shape":[16],"dtype":"float32"},{"name":"sequential_1/dense_9/kernel","shape":[16,1],"dtype":"float32"},{"name":"sequential_1/dense_9/bias","shape":[1],"dtype":"float32"}]}]}